app/controllers/collections_controller.rb

  def index
    @root_collections = Collection.where(:collection_id => nil)
---
SELECT "collections".* FROM "collections" WHERE "collections"."collection_id" IS NULL

  def show
    @collection = Collection.find(params[:id])
---
SELECT "collections".* FROM "collections" WHERE "collections"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @collection = Collection.new(params[:collection])

    respond_to do |format|
      if @collection.save
---
INSERT INTO "collections" ("collection_id", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?)  [["collection_id", nil], ["created_at", Tue, 22 May 2012 04:03:40 UTC +00:00], ["name", "test"], ["updated_at", Tue, 22 May 2012 04:03:40 UTC +00:00]]

  def destroy
    @collection = Collection.find(params[:id])
    @collection.destroy
---
SELECT "collections".* FROM "collections" WHERE "collections"."id" = ? LIMIT 1  [["id", "4"]]
DELETE FROM "collections" WHERE "collections"."id" = ?  [["id", 4]]